# FabricationPartSheetmetalArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPartSheetmetalArea Property
ParameterTypeId Class See Also
---
"Part Sheet Metal Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPartSheetmetalArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartSheetmetalArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPartSheetmetalArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace